IDENTIFICATION DIVISION.
PROGRAM-ID. CONNXWRAP.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MANAGER PIC X(48) VALUE SPACES.
01 CONNECT-OPTS.
   10 MQCNO.
      15 CNO-ID PIC X(4) VALUE 'CNO '.
      15 CNO-VERSION PIC S9(9) BINARY VALUE 1.
      15 CNO-OPTIONS PIC S9(9) BINARY VALUE 32.
      15 CNO-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 HCONN PIC S9(9) BINARY VALUE 77.
01 CC PIC S9(9) BINARY VALUE 17.
01 REASON PIC S9(9) BINARY VALUE 19.
PROCEDURE DIVISION.
CALL 'MQCONNX' USING BY REFERENCE MANAGER CONNECT-OPTS HCONN CC REASON.
CALL 'MQCMIT' USING HCONN CC REASON.
CALL 'MQBACK' USING HCONN CC REASON.
CALL 'MQDISC' USING HCONN CC REASON.
STOP RUN.
