IDENTIFICATION DIVISION.
PROGRAM-ID. MQROOT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 QM PIC X(48) VALUE SPACES.
01 HC PIC S9(9) BINARY.
01 OLD-HC PIC S9(9) BINARY.
01 OD.
   02 OID PIC X(4) VALUE 'OD  '.
   02 OV PIC S9(9) BINARY VALUE 1.
   02 OT PIC S9(9) BINARY VALUE 1.
   02 ONAME PIC X(48) VALUE 'Q'.
   02 OMGR PIC X(48) VALUE SPACES.
   02 ODYN PIC X(48) VALUE 'CSQ.*'.
   02 OUSER PIC X(12) VALUE SPACES.
   02 SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 OPT PIC S9(9) BINARY VALUE 16.
01 CO PIC S9(9) BINARY VALUE 0.
01 HO PIC S9(9) BINARY.
01 OLD-HO PIC S9(9) BINARY.
01 CC PIC S9(9) BINARY.
01 RC PIC S9(9) BINARY.
PROCEDURE DIVISION.
CALL 'MQCONN' USING QM HC CC RC.
IF CC NOT = 0 OR RC NOT = 0 DISPLAY 'BAD-CONN' END-IF.
MOVE HC TO OLD-HC.
CALL 'MQOPEN' USING HC OD OPT HO CC RC.
IF CC NOT = 0 OR RC NOT = 0 DISPLAY 'BAD-OPEN' END-IF.
IF SUFFIX NOT = 'TAIL0123' DISPLAY 'BAD-SUFFIX' END-IF.
MOVE HO TO OLD-HO.
CALL 'MQCLOSE' USING HC HO CO CC RC.
IF CC NOT = 0 OR RC NOT = 0 DISPLAY 'BAD-CLOSE' END-IF.
IF HO NOT = OLD-HO DISPLAY 'BAD-UNDEFINED-HOBJ' END-IF.
CALL 'MQDISC' USING HC CC RC.
IF CC NOT = 0 OR RC NOT = 0 DISPLAY 'BAD-DISC' END-IF.
DISPLAY 'POINT-DONE'.
GOBACK.
