IDENTIFICATION DIVISION.
PROGRAM-ID. MQGETER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MANAGER PIC X(48) VALUE SPACES.
01 HCONN PIC S9(9) BINARY VALUE 77.
01 OBJECT-DESC.
   05 OD-STRUCID PIC X(4) VALUE 'OD  '.
   05 OD-VERSION PIC S9(9) BINARY VALUE 1.
   05 OD-OBJECTTYPE PIC S9(9) BINARY VALUE 1.
   05 OD-OBJECTNAME PIC X(48) VALUE 'Q'.
   05 OD-OBJECTQMGRNAME PIC X(48) VALUE SPACES.
   05 OD-DYNAMICQNAME PIC X(48) VALUE 'CSQ.*'.
   05 OD-ALTERNATEUSERID PIC X(12) VALUE SPACES.
   05 OD-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 MESSAGE-DESC.
   05 MD-STRUCID PIC X(4) VALUE 'MD  '.
   05 MD-VERSION PIC S9(9) BINARY VALUE 1.
   05 MD-REPORT PIC S9(9) BINARY VALUE 0.
   05 MD-MSGTYPE PIC S9(9) BINARY VALUE 8.
   05 MD-EXPIRY PIC S9(9) BINARY VALUE -1.
   05 MD-FEEDBACK PIC S9(9) BINARY VALUE 0.
   05 MD-ENCODING PIC S9(9) BINARY VALUE 785.
   05 MD-CODEDCHARSETID PIC S9(9) BINARY VALUE 819.
   05 MD-FORMAT PIC X(8) VALUE SPACES.
   05 MD-PRIORITY PIC S9(9) BINARY VALUE 0.
   05 MD-PERSISTENCE PIC S9(9) BINARY VALUE 1.
   05 MD-MSGID PIC X(24) VALUE LOW-VALUES.
   05 MD-CORRELID PIC X(24) VALUE LOW-VALUES.
   05 MD-BACKOUTCOUNT PIC S9(9) BINARY VALUE 73.
   05 MD-REPLYTOQ PIC X(48) VALUE SPACES.
   05 MD-REPLYTOQMGR PIC X(48) VALUE SPACES.
   05 MD-USERIDENTIFIER PIC X(12) VALUE 'INPUT'.
   05 MD-ACCOUNTINGTOKEN PIC X(32) VALUE 'INPUT'.
   05 MD-APPLIDENTITYDATA PIC X(32) VALUE 'INPUT'.
   05 MD-PUTAPPLTYPE PIC S9(9) BINARY VALUE 0.
   05 MD-PUTAPPLNAME PIC X(28) VALUE 'INPUT'.
   05 MD-PUTDATE PIC X(8) VALUE 'INPUT'.
   05 MD-PUTTIME PIC X(8) VALUE 'INPUT'.
   05 MD-APPLORIGINDATA PIC X(4) VALUE 'INPUT'.
   05 MD-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 GET-OPTS.
   05 GMO-STRUCID PIC X(4) VALUE 'GMO '.
   05 GMO-VERSION PIC S9(9) BINARY VALUE 1.
   05 GMO-OPTIONS PIC S9(9) BINARY VALUE 2.
   05 GMO-WAITINTERVAL PIC S9(9) BINARY VALUE 0.
   05 GMO-SIGNAL1 PIC S9(9) BINARY VALUE 73.
   05 GMO-SIGNAL2 PIC S9(9) BINARY VALUE -77.
   05 GMO-RESOLVEDQNAME PIC X(48) VALUE 'INPUT-Q'.
   05 GMO-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 OPEN-OPTIONS PIC S9(9) BINARY VALUE 2.
01 CLOSE-OPTIONS PIC S9(9) BINARY VALUE 0.
01 HOBJ PIC S9(9) BINARY VALUE 71.
01 BUFFER-LENGTH PIC S9(9) BINARY VALUE 5.
01 MESSAGE-BUFFER PIC X(2048) VALUE 'xxxxxTAIL'.
01 DATA-LENGTH PIC S9(9) BINARY VALUE 29.
01 CC PIC S9(9) BINARY VALUE 17.
01 REASON PIC S9(9) BINARY VALUE 19.
01 EXPECTED-EMPTY-ID PIC X(24) VALUE LOW-VALUES.
PROCEDURE DIVISION.
CALL 'MQCONN' USING BY REFERENCE MANAGER HCONN CC REASON.
CALL 'MQOPEN' USING BY REFERENCE HCONN OBJECT-DESC OPEN-OPTIONS HOBJ CC REASON.
CALL 'MQGET' USING BY REFERENCE HCONN HOBJ MESSAGE-DESC GET-OPTS BUFFER-LENGTH MESSAGE-BUFFER DATA-LENGTH CC REASON.
GOBACK.
