IDENTIFICATION DIVISION.
PROGRAM-ID. MQROOT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MANAGER PIC X(48) VALUE SPACES.
01 HCONN PIC S9(9) BINARY VALUE 77.
01 OBJECT-DESC.
   05 OD-STRUCID PIC X(4) VALUE 'OD  '.
   05 OD-VERSION PIC S9(9) BINARY VALUE 1.
   05 OD-OBJECTTYPE PIC S9(9) BINARY VALUE 1.
   05 OD-OBJECTNAME PIC X(48) VALUE 'Q'.
   05 OD-OBJECTQMGRNAME PIC X(48) VALUE SPACES.
   05 OD-DYNAMICQNAME PIC X(48) VALUE 'CSQ.*'.
   05 OD-ALTERNATEUSERID PIC X(12) VALUE SPACES.
   05 OD-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 MESSAGE-DESC.
   05 MD-STRUCID PIC X(4) VALUE 'MD  '.
   05 MD-VERSION PIC S9(9) BINARY VALUE 1.
   05 MD-REPORT PIC S9(9) BINARY VALUE 0.
   05 MD-MSGTYPE PIC S9(9) BINARY VALUE 8.
   05 MD-EXPIRY PIC S9(9) BINARY VALUE -1.
   05 MD-FEEDBACK PIC S9(9) BINARY VALUE 0.
   05 MD-ENCODING PIC S9(9) BINARY VALUE 785.
   05 MD-CODEDCHARSETID PIC S9(9) BINARY VALUE 819.
   05 MD-FORMAT PIC X(8) VALUE SPACES.
   05 MD-PRIORITY PIC S9(9) BINARY VALUE 0.
   05 MD-PERSISTENCE PIC S9(9) BINARY VALUE 1.
   05 MD-MSGID PIC X(24) VALUE 'ABCDEFGHIJKLMNOPQRSTUVWX'.
   05 MD-CORRELID PIC X(24) VALUE LOW-VALUES.
   05 MD-BACKOUTCOUNT PIC S9(9) BINARY VALUE 73.
   05 MD-REPLYTOQ PIC X(48) VALUE SPACES.
   05 MD-REPLYTOQMGR PIC X(48) VALUE SPACES.
   05 MD-USERIDENTIFIER PIC X(12) VALUE 'INPUT'.
   05 MD-ACCOUNTINGTOKEN PIC X(32) VALUE 'INPUT'.
   05 MD-APPLIDENTITYDATA PIC X(32) VALUE 'INPUT'.
   05 MD-PUTAPPLTYPE PIC S9(9) BINARY VALUE 0.
   05 MD-PUTAPPLNAME PIC X(28) VALUE 'INPUT'.
   05 MD-PUTDATE PIC X(8) VALUE 'INPUT'.
   05 MD-PUTTIME PIC X(8) VALUE 'INPUT'.
   05 MD-APPLORIGINDATA PIC X(4) VALUE 'INPUT'.
   05 MD-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 PUT-OPTS.
   05 PMO-STRUCID PIC X(4) VALUE 'PMO '.
   05 PMO-VERSION PIC S9(9) BINARY VALUE 1.
   05 PMO-OPTIONS PIC S9(9) BINARY VALUE 147458.
   05 PMO-TIMEOUT PIC S9(9) BINARY VALUE -77.
   05 PMO-CONTEXT PIC S9(9) BINARY VALUE 0.
   05 PMO-KNOWNDESTCOUNT PIC S9(9) BINARY VALUE 111.
   05 PMO-UNKNOWNDESTCOUNT PIC S9(9) BINARY VALUE 222.
   05 PMO-INVALIDDESTCOUNT PIC S9(9) BINARY VALUE 333.
   05 PMO-RESOLVEDQNAME PIC X(48) VALUE SPACES.
   05 PMO-RESOLVEDQMGRNAME PIC X(48) VALUE SPACES.
   05 PMO-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 OPEN-OPTIONS PIC S9(9) BINARY VALUE 16.
01 CLOSE-OPTIONS PIC S9(9) BINARY VALUE 0.
01 HOBJ PIC S9(9) BINARY VALUE 71.
01 BUFFER-LENGTH PIC S9(9) BINARY VALUE 5.
01 MESSAGE-BUFFER PIC X(2048) VALUE 'HELLOTAIL'.
01 EXPECTED-CORRELID PIC X(24) VALUE LOW-VALUES.
01 CC PIC S9(9) BINARY VALUE 17.
01 REASON PIC S9(9) BINARY VALUE 19.
PROCEDURE DIVISION.
CALL 'MQCONN' USING BY REFERENCE MANAGER HCONN CC REASON.
CALL 'MQOPEN' USING BY REFERENCE HCONN OBJECT-DESC OPEN-OPTIONS HOBJ CC REASON.
CALL 'MQPUT' USING BY REFERENCE HCONN HOBJ MESSAGE-DESC PUT-OPTS BUFFER-LENGTH MESSAGE-BUFFER CC REASON.
IF CC NOT = 0 OR REASON NOT = 0 DISPLAY 'BAD-PUT' END-IF.
IF MD-MSGID NOT = 'ABCDEFGHIJKLMNOPQRSTUVWX' DISPLAY 'BAD-MSGID' END-IF.
IF MD-CORRELID NOT = EXPECTED-CORRELID DISPLAY 'BAD-CORRELID' END-IF.
IF MD-BACKOUTCOUNT NOT = 73 DISPLAY 'BAD-IGNORED-COUNTER' END-IF.
IF MD-USERIDENTIFIER NOT = SPACES OR MD-APPLIDENTITYDATA NOT = SPACES OR MD-PUTAPPLNAME NOT = SPACES OR MD-PUTDATE NOT = SPACES OR MD-PUTTIME NOT = SPACES OR MD-APPLORIGINDATA NOT = SPACES DISPLAY 'BAD-NOCONTEXT' END-IF.
IF PMO-KNOWNDESTCOUNT NOT = 111 OR PMO-UNKNOWNDESTCOUNT NOT = 222 OR PMO-INVALIDDESTCOUNT NOT = 333 DISPLAY 'BAD-UNDEFINED-COUNTS' END-IF.
IF PMO-RESOLVEDQNAME NOT = 'Q' OR PMO-RESOLVEDQMGRNAME NOT = 'QM' DISPLAY 'BAD-RESOLVED' END-IF.
IF OD-SUFFIX NOT = 'TAIL0123' OR MD-SUFFIX NOT = 'TAIL0123' OR PMO-SUFFIX NOT = 'TAIL0123' DISPLAY 'BAD-SUFFIX' END-IF.
IF MESSAGE-BUFFER NOT = 'HELLOTAIL' DISPLAY 'BAD-BUFFER' END-IF.
DISPLAY 'PUT-DONE'.
GOBACK.
