IDENTIFICATION DIVISION.
PROGRAM-ID. DISCSIBLING.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MANAGER PIC X(48) VALUE SPACES.
01 HCONN PIC S9(9) BINARY VALUE 1.
01 OBJECT-DESC.
   05 OD-COPY.
   10 OD-STRUCID PIC X(4) VALUE 'OD  '.
   10 OD-VERSION PIC S9(9) BINARY VALUE 1.
   10 OD-OBJECTTYPE PIC S9(9) BINARY VALUE 1.
   10 OD-OBJECTNAME PIC X(48) VALUE 'ORDINARY.Q'.
   10 OD-OBJECTQMGRNAME PIC X(48) VALUE SPACES.
   10 OD-DYNAMICQNAME PIC X(48) VALUE 'CSQ.*'.
   10 OD-ALTERNATEUSERID PIC X(12) VALUE SPACES.
   05 OD-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 MESSAGE-DESC.
   05 MD-COPY.
   10 MD-STRUCID PIC X(4) VALUE 'MD  '.
   10 MD-VERSION PIC S9(9) BINARY VALUE 2.
   10 MD-REPORT PIC S9(9) BINARY VALUE 0.
   10 MD-MSGTYPE PIC S9(9) BINARY VALUE 8.
   10 MD-EXPIRY PIC S9(9) BINARY VALUE -1.
   10 MD-FEEDBACK PIC S9(9) BINARY VALUE 0.
   10 MD-ENCODING PIC S9(9) BINARY VALUE 785.
   10 MD-CODEDCHARSETID PIC S9(9) BINARY VALUE 819.
   10 MD-FORMAT PIC X(8) VALUE SPACES.
   10 MD-PRIORITY PIC S9(9) BINARY VALUE 0.
   10 MD-PERSISTENCE PIC S9(9) BINARY VALUE 1.
   10 MD-MSGID PIC X(24) VALUE LOW-VALUES.
   10 MD-CORRELID PIC X(24) VALUE LOW-VALUES.
   10 MD-BACKOUTCOUNT PIC S9(9) BINARY VALUE 73.
   10 MD-REPLYTOQ PIC X(48) VALUE SPACES.
   10 MD-REPLYTOQMGR PIC X(48) VALUE SPACES.
   10 MD-USERIDENTIFIER PIC X(12) VALUE 'INPUT'.
   10 MD-ACCOUNTINGTOKEN PIC X(32) VALUE 'INPUT'.
   10 MD-APPLIDENTITYDATA PIC X(32) VALUE 'INPUT'.
   10 MD-PUTAPPLTYPE PIC S9(9) BINARY VALUE 0.
   10 MD-PUTAPPLNAME PIC X(28) VALUE 'INPUT'.
   10 MD-PUTDATE PIC X(8) VALUE 'INPUT'.
   10 MD-PUTTIME PIC X(8) VALUE 'INPUT'.
   10 MD-APPLORIGINDATA PIC X(4) VALUE 'INPUT'.
   10 MD-GROUPID PIC X(24) VALUE LOW-VALUES.
   10 MD-MSGSEQNUMBER PIC S9(9) BINARY VALUE 1.
   10 MD-OFFSET PIC S9(9) BINARY VALUE 0.
   10 MD-MSGFLAGS PIC S9(9) BINARY VALUE 0.
   10 MD-ORIGINALLENGTH PIC S9(9) BINARY VALUE -1.
   05 MD-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 GET-OPTS.
   05 GMO-COPY.
   10 GMO-STRUCID PIC X(4) VALUE 'GMO '.
   10 GMO-VERSION PIC S9(9) BINARY VALUE 1.
   10 GMO-OPTIONS PIC S9(9) BINARY VALUE 4.
   10 GMO-WAITINTERVAL PIC S9(9) BINARY VALUE 0.
   10 GMO-SIGNAL1 PIC S9(9) BINARY VALUE 73.
   10 GMO-SIGNAL2 PIC S9(9) BINARY VALUE -77.
   10 GMO-RESOLVEDQNAME PIC X(48) VALUE SPACES.
   05 GMO-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 OPEN-OPTIONS PIC S9(9) BINARY VALUE 2.
01 CLOSE-OPTIONS PIC S9(9) BINARY VALUE 0.
01 HOBJ PIC S9(9) BINARY VALUE 2.
01 BUFFER-LENGTH PIC S9(9) BINARY VALUE 5.
01 MESSAGE-BUFFER PIC X(2048) VALUE 'HELLOTAIL'.
01 DATA-LENGTH PIC S9(9) BINARY VALUE 29.
01 CC PIC S9(9) BINARY VALUE 17.
01 REASON PIC S9(9) BINARY VALUE 19.
PROCEDURE DIVISION.
CALL 'MQDISC' USING BY REFERENCE HCONN CC REASON.
STOP RUN.
