       01 DFHBMSCA-VALUES.
          02 DFHBMUNP PIC X VALUE X'C0'.
          02 DFHBMPRO PIC X VALUE X'F0'.
          02 DFHBMBRY PIC X VALUE X'C8'.
          02 DFHBMDAR PIC X VALUE X'CC'.
          02 DFHBMFSE PIC X VALUE X'C1'.
          02 DFHBMPRF PIC X VALUE X'F1'.
          02 DFHBMASF PIC X VALUE X'F1'.
          02 DFHBMASB PIC X VALUE X'F8'.
          02 DFHBLUE PIC X VALUE X'F1'.
          02 DFHRED PIC X VALUE X'F2'.
          02 DFHGREEN PIC X VALUE X'F4'.
          02 DFHNEUTR PIC X VALUE X'F7'.
          02 DFHDFCOL PIC X VALUE X'00'.
