IDENTIFICATION DIVISION.
PROGRAM-ID. PUT2TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MANAGER PIC X(48) VALUE SPACES.
01 HCONN PIC S9(9) BINARY VALUE 77.
01 OBJECT-DESC.
   05 OD-COPY.
   10 OD-STRUCID PIC X(4) VALUE 'OD  '.
   10 OD-VERSION PIC S9(9) BINARY VALUE 1.
   10 OD-OBJECTTYPE PIC S9(9) BINARY VALUE 1.
   10 OD-OBJECTNAME PIC X(48) VALUE 'ORDINARY.Q'.
   10 OD-OBJECTQMGRNAME PIC X(48) VALUE SPACES.
   10 OD-DYNAMICQNAME PIC X(48) VALUE 'CSQ.*'.
   10 OD-ALTERNATEUSERID PIC X(12) VALUE SPACES.
   05 OD-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 MESSAGE-DESC.
   05 MD-COPY.
   10 MD-STRUCID PIC X(4) VALUE 'MD  '.
   10 MD-VERSION PIC S9(9) BINARY VALUE 2.
   10 MD-REPORT PIC S9(9) BINARY VALUE 0.
   10 MD-MSGTYPE PIC S9(9) BINARY VALUE 8.
   10 MD-EXPIRY PIC S9(9) BINARY VALUE -1.
   10 MD-FEEDBACK PIC S9(9) BINARY VALUE 0.
   10 MD-ENCODING PIC S9(9) BINARY VALUE 785.
   10 MD-CODEDCHARSETID PIC S9(9) BINARY VALUE 819.
   10 MD-FORMAT PIC X(8) VALUE SPACES.
   10 MD-PRIORITY PIC S9(9) BINARY VALUE 0.
   10 MD-PERSISTENCE PIC S9(9) BINARY VALUE 1.
   10 MD-MSGID PIC X(24) VALUE 'ABCDEFGHIJKLMNOPQRSTUVWX'.
   10 MD-CORRELID PIC X(24) VALUE 'ZYXWVUTSRQPONMLKJIHGFEDC'.
   10 MD-BACKOUTCOUNT PIC S9(9) BINARY VALUE 73.
   10 MD-REPLYTOQ PIC X(48) VALUE SPACES.
   10 MD-REPLYTOQMGR PIC X(48) VALUE SPACES.
   10 MD-USERIDENTIFIER PIC X(12) VALUE 'INPUT'.
   10 MD-ACCOUNTINGTOKEN PIC X(32) VALUE 'INPUT'.
   10 MD-APPLIDENTITYDATA PIC X(32) VALUE 'INPUT'.
   10 MD-PUTAPPLTYPE PIC S9(9) BINARY VALUE 0.
   10 MD-PUTAPPLNAME PIC X(28) VALUE 'INPUT'.
   10 MD-PUTDATE PIC X(8) VALUE 'INPUT'.
   10 MD-PUTTIME PIC X(8) VALUE 'INPUT'.
   10 MD-APPLORIGINDATA PIC X(4) VALUE 'INPUT'.
   10 MD-GROUPID PIC X(24) VALUE LOW-VALUES.
   10 MD-MSGSEQNUMBER PIC S9(9) BINARY VALUE 1.
   10 MD-OFFSET PIC S9(9) BINARY VALUE 0.
   10 MD-MSGFLAGS PIC S9(9) BINARY VALUE 0.
   10 MD-ORIGINALLENGTH PIC S9(9) BINARY VALUE -1.
   05 MD-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 PUT-OPTS.
   05 PMO-COPY.
   10 PMO-STRUCID PIC X(4) VALUE 'PMO '.
   10 PMO-VERSION PIC S9(9) BINARY VALUE 1.
   10 PMO-OPTIONS PIC S9(9) BINARY VALUE 147460.
   10 PMO-TIMEOUT PIC S9(9) BINARY VALUE -77.
   10 PMO-CONTEXT PIC S9(9) BINARY VALUE 0.
   10 PMO-KNOWNDESTCOUNT PIC S9(9) BINARY VALUE 111.
   10 PMO-UNKNOWNDESTCOUNT PIC S9(9) BINARY VALUE 222.
   10 PMO-INVALIDDESTCOUNT PIC S9(9) BINARY VALUE 333.
   10 PMO-RESOLVEDQNAME PIC X(48) VALUE SPACES.
   10 PMO-RESOLVEDQMGRNAME PIC X(48) VALUE SPACES.
   05 PMO-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 OPEN-OPTIONS PIC S9(9) BINARY VALUE 16.
01 CLOSE-OPTIONS PIC S9(9) BINARY VALUE 0.
01 HOBJ PIC S9(9) BINARY VALUE 71.
01 BUFFER-LENGTH PIC S9(9) BINARY VALUE 5.
01 MESSAGE-BUFFER PIC X(2048) VALUE 'HELLOTAIL'.
01 CC PIC S9(9) BINARY VALUE 17.
01 REASON PIC S9(9) BINARY VALUE 19.
PROCEDURE DIVISION.
CALL 'MQCONN' USING BY REFERENCE MANAGER HCONN CC REASON.
CALL 'MQOPEN' USING BY REFERENCE HCONN OBJECT-DESC OPEN-OPTIONS HOBJ CC REASON.
CALL 'MQPUT' USING BY REFERENCE HCONN HOBJ MESSAGE-DESC PUT-OPTS BUFFER-LENGTH MESSAGE-BUFFER CC REASON.
CALL 'MQCLOSE' USING BY REFERENCE HCONN HOBJ CLOSE-OPTIONS CC REASON.
CALL 'MQDISC' USING BY REFERENCE HCONN CC REASON.
STOP RUN.
