          05 MQGMO-STRUCID PIC X(4) VALUE 'GMO '.
          05 MQGMO-VERSION PIC S9(9) BINARY VALUE 4.
          05 MQGMO-OPTIONS PIC S9(9) BINARY VALUE 0.
          05 MQGMO-WAITINTERVAL PIC S9(9) BINARY VALUE 0.
          05 FILLER PIC X(96) VALUE LOW-VALUES.
