          05 MQMD-STRUCID PIC X(4) VALUE 'MD  '.
          05 MQMD-VERSION PIC S9(9) BINARY VALUE 2.
          05 MQMD-REPORT PIC S9(9) BINARY VALUE 0.
          05 MQMD-MSGTYPE PIC S9(9) BINARY VALUE 8.
          05 MQMD-EXPIRY PIC S9(9) BINARY VALUE -1.
          05 MQMD-FEEDBACK PIC S9(9) BINARY VALUE 0.
          05 MQMD-ENCODING PIC S9(9) BINARY VALUE 0.
          05 MQMD-CODEDCHARSETID PIC S9(9) BINARY VALUE 0.
          05 MQMD-FORMAT PIC X(8) VALUE SPACES.
          05 MQMD-PRIORITY PIC S9(9) BINARY VALUE -1.
          05 MQMD-PERSISTENCE PIC S9(9) BINARY VALUE 2.
          05 MQMD-MSGID PIC X(24) VALUE LOW-VALUES.
          05 MQMD-CORRELID PIC X(24) VALUE LOW-VALUES.
          05 MQMD-BACKOUTCOUNT PIC S9(9) BINARY VALUE 0.
          05 MQMD-REPLYTOQ PIC X(48) VALUE SPACES.
          05 MQMD-REPLYTOQMGR PIC X(48) VALUE SPACES.
          05 MQMD-USERIDENTIFIER PIC X(12) VALUE SPACES.
          05 MQMD-ACCOUNTINGTOKEN PIC X(32) VALUE LOW-VALUES.
          05 MQMD-APPLIDENTITYDATA PIC X(32) VALUE SPACES.
          05 MQMD-PUTAPPLTYPE PIC S9(9) BINARY VALUE 0.
          05 MQMD-PUTAPPLNAME PIC X(28) VALUE SPACES.
          05 MQMD-PUTDATE PIC X(8) VALUE SPACES.
          05 MQMD-PUTTIME PIC X(8) VALUE SPACES.
          05 MQMD-APPLORIGINDATA PIC X(4) VALUE SPACES.
          05 MQMD-GROUPID PIC X(24) VALUE LOW-VALUES.
          05 MQMD-MSGSEQNUMBER PIC S9(9) BINARY VALUE 1.
          05 MQMD-OFFSET PIC S9(9) BINARY VALUE 0.
          05 MQMD-MSGFLAGS PIC S9(9) BINARY VALUE 0.
          05 MQMD-ORIGINALLENGTH PIC S9(9) BINARY VALUE -1.
