          05 MQOD-STRUCID PIC X(4) VALUE 'OD  '.
          05 MQOD-VERSION PIC S9(9) BINARY VALUE 4.
          05 MQOD-OBJECTTYPE PIC S9(9) BINARY VALUE 1.
          05 MQOD-OBJECTNAME PIC X(48) VALUE SPACES.
          05 MQOD-OBJECTQMGRNAME PIC X(48) VALUE SPACES.
          05 MQOD-DYNAMICQNAME PIC X(48) VALUE 'AMQ.*'.
          05 MQOD-ALTERNATEUSERID PIC X(12) VALUE SPACES.
          05 FILLER PIC X(232) VALUE LOW-VALUES.
