          05 MQPMO-STRUCID PIC X(4) VALUE 'PMO '.
          05 MQPMO-VERSION PIC S9(9) BINARY VALUE 3.
          05 MQPMO-OPTIONS PIC S9(9) BINARY VALUE 0.
          05 FILLER PIC X(164) VALUE LOW-VALUES.
