IDENTIFICATION DIVISION.
PROGRAM-ID. POINTCHILD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 HCONN PIC S9(9) BINARY VALUE 1.
01 HOBJ PIC S9(9) BINARY VALUE 2.
01 CLOSE-OPTIONS PIC S9(9) BINARY VALUE 0.
01 CC PIC S9(9) BINARY VALUE 17.
01 REASON PIC S9(9) BINARY VALUE 19.
PROCEDURE DIVISION.
CALL 'MQCLOSE' USING BY REFERENCE HCONN HOBJ CLOSE-OPTIONS CC REASON.
STOP RUN.
