IDENTIFICATION DIVISION.
PROGRAM-ID. POINTTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MANAGER PIC X(48) VALUE SPACES.
01 HCONN PIC S9(9) BINARY VALUE 77.
01 OBJECT-DESC.
   05 OD-ID PIC X(4) VALUE 'OD  '.
   05 OD-VERSION PIC S9(9) BINARY VALUE 1.
   05 OD-TYPE PIC S9(9) BINARY VALUE 1.
   05 OD-NAME PIC X(48) VALUE 'ORDINARY.Q'.
   05 OD-MANAGER PIC X(48) VALUE SPACES.
   05 OD-DYNAMIC PIC X(48) VALUE 'CSQ.*'.
   05 OD-USER PIC X(12) VALUE SPACES.
   05 OD-SUFFIX PIC X(8) VALUE 'TAIL0123'.
01 OPTIONS PIC S9(9) BINARY VALUE 16.
01 CLOSE-OPTIONS PIC S9(9) BINARY VALUE 0.
01 HOBJ PIC S9(9) BINARY VALUE 71.
01 CC PIC S9(9) BINARY VALUE 17.
01 REASON PIC S9(9) BINARY VALUE 19.
PROCEDURE DIVISION.
CALL 'MQCONN' USING BY REFERENCE MANAGER HCONN CC REASON.
CALL 'MQOPEN' USING BY REFERENCE HCONN OBJECT-DESC OPTIONS HOBJ CC REASON.
CALL 'MQCLOSE' USING BY REFERENCE HCONN HOBJ CLOSE-OPTIONS CC REASON.
CALL 'MQDISC' USING BY REFERENCE HCONN CC REASON.
STOP RUN.
