       IDENTIFICATION DIVISION.
       PROGRAM-ID. COCRDSEC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  RESPONSE-TEXT PIC X(76) VALUE
           'CDV1 DEMO: ORIGINAL CREDIT CARD SEARCH CONTRACT IS NOT IN THE PIN'.
       PROCEDURE DIVISION.
           EXEC CICS
               SEND TEXT FROM(RESPONSE-TEXT)
           END-EXEC.
           EXEC CICS
               RETURN
           END-EXEC.
